Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: :cpp:enumerator:`LV_PART_MAIN` The background of the Button Matrix, uses the typical background style properties.
it_it: :cpp:enumerator:`LV_PART_MAIN` Il background della Button Matrix, utilizza le tipiche proprietà di stile del background.

source: :cpp:enumerator:`LV_PART_MAIN` The background of the Lottie animation.
it_it: :cpp:enumerator:`LV_PART_MAIN` Il background dell'animazione Lottie.

source: :cpp:enumerator:`LV_PART_MAIN` The background of the Slider.
it_it: :cpp:enumerator:`LV_PART_MAIN` Il background dello Slider.

source: :cpp:enumerator:`LV_PART_MAIN` The background of the Table; uses the :ref:`typical background style properties <typical bg props>`.
it_it: :cpp:enumerator:`LV_PART_MAIN` Il background della Table; utilizza le :ref:`tipiche proprietà di stile del background <typical bg props>`.

source: :cpp:enumerator:`LV_PART_MAIN` The background of the Text Area; uses the :ref:`typical background style properties <typical bg props>` and the text related style properties including ``text_align`` to align the text to the left, right or center.
it_it: :cpp:enumerator:`LV_PART_MAIN` Il background della Text Area; utilizza le :ref:`tipiche proprietà di stile del background <typical bg props>` e le proprietà di stile relative al testo, tra cui ``text_align``, per allineare il testo a sinistra, a destra o al centro.

source: :cpp:enumerator:`LV_PART_MAIN` The background of the button; uses the :ref:`typical background style properties <typical bg props>`.
it_it: :cpp:enumerator:`LV_PART_MAIN` Lo sfondo del pulsante; utilizza le :ref:`tipiche proprietà di stile del background <typical bg props>`.

source: :cpp:enumerator:`LV_PART_MAIN` The background of the chart.
it_it: :cpp:enumerator:`LV_PART_MAIN` Lo sfondo del grafico.

source: :cpp:enumerator:`LV_PART_MAIN` The background of the roller uses the :ref:`typical background <typical bg props>` and text style properties.
it_it: :cpp:enumerator:`LV_PART_MAIN` Il background del roller usa le proprietà di stile :ref:`tipiche del background <typical bg props>` e del testo.

source: :cpp:enumerator:`LV_PART_MAIN` The list itself; uses the :ref:`typical background style properties <typical bg props>`.
it_it: :cpp:enumerator:`LV_PART_MAIN` La lista stessa; utilizza le :ref:`tipiche proprietà di stile del background <typical bg props>`.

source: :cpp:enumerator:`LV_PART_MAIN` The main part of the List that uses the :ref:`typical background style properties <typical bg props>`.
it_it: :cpp:enumerator:`LV_PART_MAIN` La parte principale della Lista che utilizza le :ref:`tipiche proprietà di stile del background <typical bg props>`.

source: :cpp:enumerator:`LV_PART_MAIN` The main part.
it_it: :cpp:enumerator:`LV_PART_MAIN` La parte principale.

source: :cpp:enumerator:`LV_PART_MAIN` Uses the :ref:`typical background <typical bg props>` and image style properties.
it_it: :cpp:enumerator:`LV_PART_MAIN` Utilizza le proprietà :ref:`tipiche del background <typical bg props>` e lo stile dell'immagine.

source: :cpp:enumerator:`LV_PART_MAIN` Uses the :ref:`typical background <typical bg props>` and text properties.
it_it: :cpp:enumerator:`LV_PART_MAIN` Utilizza le proprietà :ref:`tipiche del background <typical bg props>` e text.

source: :cpp:enumerator:`LV_PART_MAIN` can be omitted
it_it: :cpp:enumerator:`LV_PART_MAIN` può essere omesso

source: :cpp:enumerator:`LV_PART_MAIN` uses the :ref:`typical background <typical bg props>` and line style properties.
it_it: :cpp:enumerator:`LV_PART_MAIN` utilizza le proprietà :ref:`tipiche del background <typical bg props>` e lo stile della linea.

source: :cpp:enumerator:`LV_PART_MAIN`: (0x000000) A background like rectangle
it_it: :cpp:enumerator:`LV_PART_MAIN`: (0x000000) Uno background simile a un rettangolo

source: :cpp:enumerator:`LV_PART_MAIN`: A background-like rectangle.
it_it: :cpp:enumerator:`LV_PART_MAIN`: Un rettangolo simile a uno sfondo.

source: :cpp:enumerator:`LV_PART_SCROLLBAR` A scrollbar used if the chart is zoomed.
it_it: :cpp:enumerator:`LV_PART_SCROLLBAR` Una scrollbar utilizzata se il grafico è ingrandito.

source: :cpp:enumerator:`LV_PART_SCROLLBAR` The scrollbar background, border, shadow properties and width (for its own width) and right padding for the spacing on the right.
it_it: :cpp:enumerator:`LV_PART_SCROLLBAR` Le proprietà di background, bordo, ombra e larghezza della barra di scorrimento (per la sua larghezza) e il padding destro per la spaziatura a destra.

source: :cpp:enumerator:`LV_PART_SCROLLBAR` The scrollbar that is shown when the text is larger than the Widget's size.
it_it: :cpp:enumerator:`LV_PART_SCROLLBAR` La barra di scorrimento che viene visualizzata quando il testo è più grande delle dimensioni del Widget.

source: :cpp:enumerator:`LV_PART_SCROLLBAR` The scrollbar that is shown when the text is longer than its height.
it_it: :cpp:enumerator:`LV_PART_SCROLLBAR` La scrollbar che viene visualizzata quando il testo è più lungo della sua altezza.

source: :cpp:enumerator:`LV_PART_SCROLLBAR` The scrollbar.
it_it: :cpp:enumerator:`LV_PART_SCROLLBAR` La scrollbar.

source: :cpp:enumerator:`LV_PART_SCROLLBAR`: (0x010000) The scrollbar(s)
it_it: :cpp:enumerator:`LV_PART_SCROLLBAR`: (0x010000) Le barre di scorrimento

source: :cpp:enumerator:`LV_PART_SCROLLBAR`: The scrollbar part in the default state.
it_it: :cpp:enumerator:`LV_PART_SCROLLBAR`: La parte della barra di scorrimento nello stato di default.

source: :cpp:enumerator:`LV_PART_SCROLLBAR`: The scrollbar(s).
it_it: :cpp:enumerator:`LV_PART_SCROLLBAR`: La/le barra/e di scorrimento.

source: :cpp:enumerator:`LV_PART_SELECTED` Determines the style of the :ref:`selected text <lv_label_text_selection>`.
it_it: :cpp:enumerator:`LV_PART_SELECTED` Determina lo stile del :ref:`testo selezionato <lv_label_text_selection>`.

source: :cpp:enumerator:`LV_PART_SELECTED` Refers to the currently pressed, checked or pressed+checked option.
it_it: :cpp:enumerator:`LV_PART_SELECTED` Si riferisce all'opzione attualmente premuta, checked o premuta+checked.

source: :cpp:enumerator:`LV_PART_SELECTED` Tells the style of the :ref:`selected text <lv_label_text_selection>`.
it_it: :cpp:enumerator:`LV_PART_SELECTED` Indica lo stile del :ref:`testo selezionato <lv_label_text_selection>`.

source: :cpp:enumerator:`LV_PART_SELECTED` The selected item (displayed in the middle of the Roller).
it_it: :cpp:enumerator:`LV_PART_SELECTED` L'elemento selezionato (visualizzato al centro del Roller).

source: :cpp:enumerator:`LV_PART_SELECTED`: (0x040000) Indicate the currently selected option or section
it_it: :cpp:enumerator:`LV_PART_SELECTED`: (0x040000) Indica l'opzione o la sezione attualmente selezionata

source: :cpp:enumerator:`LV_PART_SELECTED`: Indicates the currently selected option or section.
it_it: :cpp:enumerator:`LV_PART_SELECTED`: Indica l'opzione o la sezione attualmente selezionata.

source: :cpp:enumerator:`LV_PART_TEXTAREA_PLACEHOLDER` Unique to Text Area; allows styling the :ref:`placeholder text <textarea_placeholder_text>`.
it_it: :cpp:enumerator:`LV_PART_TEXTAREA_PLACEHOLDER` Unica per la Text Area; consente di applicare uno stile al :ref:`testo segnaposto <textarea_placeholder_text>`.

source: :cpp:enumerator:`LV_ROLLER_MODE_INFINITE` makes the Roller circular.
it_it: :cpp:enumerator:`LV_ROLLER_MODE_INFINITE` rende il Roller circolare.

source: :cpp:enumerator:`LV_SCREEN_LOAD_ANIM_FADE_IN` and :cpp:enumerator:`LV_SCREEN_LOAD_ANIM_FADE_OUT`: Fade the new screen over the old screen, or vice versa
it_it: :cpp:enumerator:`LV_SCREEN_LOAD_ANIM_FADE_IN` e :cpp:enumerator:`LV_SCREEN_LOAD_ANIM_FADE_OUT`: Dissolvenza del nuovo Screen su quello precedente, o viceversa.

source: :cpp:enumerator:`LV_SCREEN_LOAD_ANIM_MOVE_LEFT`, :cpp:enumerator:`LV_SCREEN_LOAD_ANIM_MOVE_RIGHT`, :cpp:enumerator:`LV_SCREEN_LOAD_ANIM_MOVE_TOP` and :cpp:enumerator:`LV_SCREEN_LOAD_ANIM_MOVE_BOTTOM`: Move both the current and new screens towards the given direction
it_it: :cpp:enumerator:`LV_SCREEN_LOAD_ANIM_MOVE_LEFT`, :cpp:enumerator:`LV_SCREEN_LOAD_ANIM_MOVE_RIGHT`, :cpp:enumerator:`LV_SCREEN_LOAD_ANIM_MOVE_TOP` e :cpp:enumerator:`LV_SCREEN_LOAD_ANIM_MOVE_BOTTOM`: Spostano sia lo Screen corrente che quello nuovo nella direzione indicata

source: :cpp:enumerator:`LV_SCREEN_LOAD_ANIM_NONE`: Switch immediately after ``delay`` milliseconds
it_it: :cpp:enumerator:`LV_SCREEN_LOAD_ANIM_NONE`: Cambia immediatamente dopo ``delay`` millisecondi

source: :cpp:enumerator:`LV_SCREEN_LOAD_ANIM_OUT_LEFT`, :cpp:enumerator:`LV_SCREEN_LOAD_ANIM_OUT_RIGHT`, :cpp:enumerator:`LV_SCREEN_LOAD_ANIM_OUT_TOP` and :cpp:enumerator:`LV_SCREEN_LOAD_ANIM_OUT_BOTTOM`: Move out the old screen over the current towards the given direction
it_it: :cpp:enumerator:`LV_SCREEN_LOAD_ANIM_OUT_LEFT`, :cpp:enumerator:`LV_SCREEN_LOAD_ANIM_OUT_RIGHT`, :cpp:enumerator:`LV_SCREEN_LOAD_ANIM_OUT_TOP` e :cpp:enumerator:`LV_SCREEN_LOAD_ANIM_OUT_BOTTOM`: Spostano il vecchio Screen sopra quello corrente nella direzione indicata

source: :cpp:enumerator:`LV_SCREEN_LOAD_ANIM_OVER_LEFT`, :cpp:enumerator:`LV_SCREEN_LOAD_ANIM_OVER_RIGHT`, :cpp:enumerator:`LV_SCREEN_LOAD_ANIM_OVER_TOP` and :cpp:enumerator:`LV_SCREEN_LOAD_ANIM_OVER_BOTTOM`: Move the new screen over the current towards the given direction
it_it: :cpp:enumerator:`LV_SCREEN_LOAD_ANIM_OVER_LEFT`, :cpp:enumerator:`LV_SCREEN_LOAD_ANIM_OVER_RIGHT`, :cpp:enumerator:`LV_SCREEN_LOAD_ANIM_OVER_TOP` e :cpp:enumerator:`LV_SCREEN_LOAD_ANIM_OVER_BOTTOM`: Spostano il nuovo Screen sopra quello corrente verso la direzione indicata

source: :cpp:enumerator:`LV_SCROLLBAR_MODE_ACTIVE`: Show scroll bars while a Widget is being scrolled
it_it: :cpp:enumerator:`LV_SCROLLBAR_MODE_ACTIVE`: Mostra le barre di scorrimento durante lo scrolling di un Widget

source: :cpp:enumerator:`LV_SCROLLBAR_MODE_AUTO`: Show scroll bars when the content is large enough to be scrolled
it_it: :cpp:enumerator:`LV_SCROLLBAR_MODE_AUTO`: Mostra le barre quando il contenuto è sufficientemente grande da poter essere scorrevole

source: :cpp:enumerator:`LV_SCROLLBAR_MODE_OFF`: Never show the scrollbars
it_it: :cpp:enumerator:`LV_SCROLLBAR_MODE_OFF`: Non mostrare mai le barre di scorrimento

source: :cpp:enumerator:`LV_SCROLLBAR_MODE_ON`: Always show the scrollbars
it_it: :cpp:enumerator:`LV_SCROLLBAR_MODE_ON`: Mostra sempre le barre di scorrimento

source: :cpp:enumerator:`LV_SCROLL_SNAP_CENTER`: Align the children to the center of a scrolled Widget
it_it: :cpp:enumerator:`LV_SCROLL_SNAP_CENTER`: Allinea gli elementi figlio al centro di un Widget scorrevole

source: :cpp:enumerator:`LV_SCROLL_SNAP_END`: Align the children to the right/bottom side of a scrolled Widget
it_it: :cpp:enumerator:`LV_SCROLL_SNAP_END`: Allinea gli elementi figlio a destra/in basso di un Widget scorrevole

source: :cpp:enumerator:`LV_SCROLL_SNAP_NONE`: Snapping is disabled.
it_it: :cpp:enumerator:`LV_SCROLL_SNAP_NONE`: Lo "Snap" [aggancio] è disabilitato.

source: :cpp:enumerator:`LV_SCROLL_SNAP_START`: Align the children to the left/top side of a scrolled Widget
it_it: :cpp:enumerator:`LV_SCROLL_SNAP_START`: Allinea gli elementi figlio a sinistra/in alto di un Widget scorrevole

source: :cpp:enumerator:`LV_SLIDER_MODE_NORMAL` A normal Slider as described above (default)
it_it: :cpp:enumerator:`LV_SLIDER_MODE_NORMAL` Uno Slider normale come descritto sopra (il default)

source: :cpp:enumerator:`LV_SLIDER_RANGE` Allows setting the start value as well by :cpp:expr:`lv_bar_set_start_value(slider, new_value, LV_ANIM_ON/OFF)`.
it_it: :cpp:enumerator:`LV_SLIDER_RANGE` Consente anche di impostare il valore iniziale tramite :cpp:expr:`lv_bar_set_start_value(slider, new_value, LV_ANIM_ON/OFF)`.

source: :cpp:enumerator:`LV_SLIDER_SYMMETRICAL` Draw the indicator from the zero value to current value.
it_it: :cpp:enumerator:`LV_SLIDER_SYMMETRICAL` Disegna l'indicatore dal valore zero al valore corrente.

source: :cpp:enumerator:`LV_SPAN_MODE_BREAK` Keep width; break lines that are too long and auto-expand height.
it_it: :cpp:enumerator:`LV_SPAN_MODE_BREAK` Mantiene la larghezza; interrompe le righe troppo lunghe ed espande automaticamente l'altezza.

source: :cpp:enumerator:`LV_SPAN_MODE_EXPAND` Expand size to text size but stay on one line.
it_it: :cpp:enumerator:`LV_SPAN_MODE_EXPAND` Espande le dimensioni fino a raggiungere quelle del testo, ma rimane su una sola riga.

source: :cpp:enumerator:`LV_SPAN_MODE_FIXED` Fixes its size.
it_it: :cpp:enumerator:`LV_SPAN_MODE_FIXED` Ne fissa le dimensioni.

source: :cpp:enumerator:`LV_SPAN_OVERFLOW_CLIP` truncates text at the limit of the area.
it_it: :cpp:enumerator:`LV_SPAN_OVERFLOW_CLIP` tronca il testo al limite dell'area.

source: :cpp:enumerator:`LV_SPAN_OVERFLOW_ELLIPSIS` display an ellipsis (``...``) when text overflows the area.
it_it: :cpp:enumerator:`LV_SPAN_OVERFLOW_ELLIPSIS` visualizza un'ellissi (``...``) quando il testo supera l'area.

source: :cpp:enumerator:`LV_STATE_CHECKED`: (0x0001) Toggled or checked state
it_it: :cpp:enumerator:`LV_STATE_CHECKED`: (0x0001) Stato attivato o selezionato

source: :cpp:enumerator:`LV_STATE_CHECKED`: Toggled or checked state
it_it: :cpp:enumerator:`LV_STATE_CHECKED`: Stato attivato o selezionato

source: :cpp:enumerator:`LV_STATE_CHECKED`: Toggled or checked state.
it_it: :cpp:enumerator:`LV_STATE_CHECKED`: Stato attivato o "checked" [selezionato].

source: :cpp:enumerator:`LV_STATE_DEFAULT` can be omitted.
it_it: :cpp:enumerator:`LV_STATE_DEFAULT` può essere omesso.

source: :cpp:enumerator:`LV_STATE_DEFAULT`: (0x0000) Normal, released state
it_it: :cpp:enumerator:`LV_STATE_DEFAULT`: (0x0000) Stato normale, rilasciato

source: :cpp:enumerator:`LV_STATE_DEFAULT`: Normal, released state
it_it: :cpp:enumerator:`LV_STATE_DEFAULT`: Normale, stato "a riposo"

source: :cpp:enumerator:`LV_STATE_DEFAULT`: Normal, released state.
it_it: :cpp:enumerator:`LV_STATE_DEFAULT`: Stato normale, rilasciato.

source: :cpp:enumerator:`LV_STATE_DEFAULT`: white
it_it: :cpp:enumerator:`LV_STATE_DEFAULT`: bianco

source: :cpp:enumerator:`LV_STATE_DISABLED`: (0x0080) Disabled state
it_it: :cpp:enumerator:`LV_STATE_DISABLED`: (0x0080) Stato disabilitato

source: :cpp:enumerator:`LV_STATE_DISABLED`: Disabled
it_it: :cpp:enumerator:`LV_STATE_DISABLED`: Disabilitato

source: :cpp:enumerator:`LV_STATE_DISABLED`: Disabled state.
it_it: :cpp:enumerator:`LV_STATE_DISABLED`: Stato disabilitato.

source: :cpp:enumerator:`LV_STATE_EDITED`: (0x0008) Edit by an encoder
it_it: :cpp:enumerator:`LV_STATE_EDITED`: (0x0008) Modifica tramite encoder

source: :cpp:enumerator:`LV_STATE_EDITED`: Being edited by an encoder.
it_it: :cpp:enumerator:`LV_STATE_EDITED`: In fase di modifica tramite encoder.

source: :cpp:enumerator:`LV_STATE_EDITED`: Edited by an encoder
it_it: :cpp:enumerator:`LV_STATE_EDITED`: Modificato tramite encoder

source: :cpp:enumerator:`LV_STATE_FOCUSED`: (0x0002) Focused via keypad or encoder or clicked via touchpad/mouse
it_it: :cpp:enumerator:`LV_STATE_FOCUSED`: (0x0002) Focus tramite tastiera, encoder o clic tramite touchpad/mouse

source: :cpp:enumerator:`LV_STATE_FOCUSED`: Focused via keypad or encoder or clicked via touchpad/mouse
it_it: :cpp:enumerator:`LV_STATE_FOCUSED`: Focus tramite tastiera, encoder o clic tramite touchpad/mouse

source: :cpp:enumerator:`LV_STATE_FOCUSED`: Focused via keypad, encoder, or clicked via touchpad/mouse.
it_it: :cpp:enumerator:`LV_STATE_FOCUSED`: Attivato tramite tastiera, encoder o cliccato tramite touchpad/mouse.

source: :cpp:enumerator:`LV_STATE_FOCUSED`: red
it_it: :cpp:enumerator:`LV_STATE_FOCUSED`: rosso

source: :cpp:enumerator:`LV_STATE_FOCUS_KEY`: (0x0004) Focused via keypad or encoder but not via touchpad/mouse
it_it: :cpp:enumerator:`LV_STATE_FOCUS_KEY`: (0x0004) Focus tramite tastiera o encoder ma non tramite touchpad/mouse

source: :cpp:enumerator:`LV_STATE_FOCUS_KEY`: Focused via keypad or encoder but not via touchpad/mouse
it_it: :cpp:enumerator:`LV_STATE_FOCUS_KEY`: Focus tramite tastiera o encoder ma non tramite touchpad/mouse

source: :cpp:enumerator:`LV_STATE_FOCUS_KEY`: Focused via keypad or encoder but not via touchpad/mouse.
it_it: :cpp:enumerator:`LV_STATE_FOCUS_KEY`: Attivato tramite tastiera o encoder, ma non tramite touchpad/mouse.

source: :cpp:enumerator:`LV_STATE_HOVERED`: (0x0010) Hovered by mouse
it_it: :cpp:enumerator:`LV_STATE_HOVERED`: (0x0010) Sovrapposto dal mouse

source: :cpp:enumerator:`LV_STATE_HOVERED`: Hovered by a mouse (currently not supported).
it_it: :cpp:enumerator:`LV_STATE_HOVERED`: Sorvolato dal mouse (attualmente non supportato).

source: :cpp:enumerator:`LV_STATE_HOVERED`: Hovered by mouse
it_it: :cpp:enumerator:`LV_STATE_HOVERED`: Passaggio del mouse

source: :cpp:enumerator:`LV_STATE_PRESSED`: (0x0020) Being pressed
it_it: :cpp:enumerator:`LV_STATE_PRESSED`: (0x0020) Premuto

source: :cpp:enumerator:`LV_STATE_PRESSED`: Being pressed
it_it: :cpp:enumerator:`LV_STATE_PRESSED`: Premuto

source: :cpp:enumerator:`LV_STATE_PRESSED`: Being pressed.
it_it: :cpp:enumerator:`LV_STATE_PRESSED`: Premuto.

source: :cpp:enumerator:`LV_STATE_PRESSED`: The main part in pressed state.
it_it: :cpp:enumerator:`LV_STATE_PRESSED`: La parte "main" [principale] in stato premuto.

source: :cpp:enumerator:`LV_STATE_PRESSED`: gray
it_it: :cpp:enumerator:`LV_STATE_PRESSED`: grigio

source: :cpp:enumerator:`LV_STATE_SCROLLED`: (0x0040) Being scrolled
it_it: :cpp:enumerator:`LV_STATE_SCROLLED`: (0x0040) In scorrimento

source: :cpp:enumerator:`LV_STATE_SCROLLED`: Being scrolled
it_it: :cpp:enumerator:`LV_STATE_SCROLLED`: In corso di scrolling

source: :cpp:enumerator:`LV_STATE_SCROLLED`: Being scrolled.
it_it: :cpp:enumerator:`LV_STATE_SCROLLED`: "Scrolled".

source: :cpp:enumerator:`LV_STATE_USER_1`: (0x1000) Custom state
it_it: :cpp:enumerator:`LV_STATE_USER_1`: (0x1000) Stato personalizzato

source: :cpp:enumerator:`LV_STATE_USER_1`: Custom state.
it_it: :cpp:enumerator:`LV_STATE_USER_1`: Stato personalizzato.

source: :cpp:enumerator:`LV_STATE_USER_2`: (0x2000) Custom state
it_it: :cpp:enumerator:`LV_STATE_USER_2`: (0x2000) Stato personalizzato

source: :cpp:enumerator:`LV_STATE_USER_2`: Custom state.
it_it: :cpp:enumerator:`LV_STATE_USER_2`: Stato personalizzato.

source: :cpp:enumerator:`LV_STATE_USER_3`: (0x4000) Custom state
it_it: :cpp:enumerator:`LV_STATE_USER_3`: (0x4000) Stato personalizzato

source: :cpp:enumerator:`LV_STATE_USER_3`: Custom state.
it_it: :cpp:enumerator:`LV_STATE_USER_3`: Stato personalizzato.

source: :cpp:enumerator:`LV_STATE_USER_4`: (0x8000) Custom state
it_it: :cpp:enumerator:`LV_STATE_USER_4`: (0x8000) Stato personalizzato

source: :cpp:enumerator:`LV_STATE_USER_4`: Custom state.
it_it: :cpp:enumerator:`LV_STATE_USER_4`: Stato personalizzato.

source: :cpp:enumerator:`LV_TEXTAREA_CURSOR_LAST` can be passed to mean "after the last character"
it_it: :cpp:enumerator:`LV_TEXTAREA_CURSOR_LAST` può essere passato per indicare "dopo l'ultimo carattere".

source: :cpp:enumerator:`LV_TEXT_ALIGN_AUTO` Align auto.
it_it: :cpp:enumerator:`LV_TEXT_ALIGN_AUTO` Allinea automaticamente.

source: :cpp:enumerator:`LV_TEXT_ALIGN_CENTER` Center text.
it_it: :cpp:enumerator:`LV_TEXT_ALIGN_CENTER` Centra il testo.

source: :cpp:enumerator:`LV_TEXT_ALIGN_LEFT` Align text to left.
it_it: :cpp:enumerator:`LV_TEXT_ALIGN_LEFT` Allinea il testo a sinistra.

source: :cpp:enumerator:`LV_TEXT_ALIGN_RIGHT` Align text to right edge.
it_it: :cpp:enumerator:`LV_TEXT_ALIGN_RIGHT` Allinea il testo al bordo destro.

source: :cpp:enumerator:`LY_KEY_ENTER` Accept the selected option (sends :cpp:enumerator:`LV_EVENT_VALUE_CHANGED` event)
it_it: :cpp:enumerator:`LY_KEY_ENTER` Accetta l'opzione selezionata (invia l'evento :cpp:enumerator:`LV_EVENT_VALUE_CHANGED`)

source: :cpp:expr:`LV_GRID_FR(X)` determines what portion of the remaining space should be used by this track.
it_it: :cpp:expr:`LV_GRID_FR(X)` determina quale porzione dello spazio rimanente deve essere utilizzata da questa track.

source: :cpp:expr:`LV_PART_INDICATOR | LV_STATE_PRESSED | LV_STATE_CHECKED` The indicator part when the Widget is pressed and checked at the same time.
it_it: :cpp:expr:`LV_PART_INDICATOR | LV_STATE_PRESSED | LV_STATE_CHECKED` La parte dell'indicatore quando il widget viene premuto e selezionato contemporaneamente.

source: :cpp:expr:`LV_PART_SCROLLBAR | LV_STATE_SCROLLED`: The scrollbar part when the Widget is being scrolled
it_it: :cpp:expr:`LV_PART_SCROLLBAR | LV_STATE_SCROLLED`: La parte della barra di scorrimento quando si scorre il widget.

source: :cpp:expr:`lv_alloc/realloc` does not make use of SPIRAM. Given the high memory usage of lottie animations, it is recommended to shift as much out of internal DRAM into SPIRAM as possible.
it_it: :cpp:expr:`lv_alloc/realloc` non utilizza SPIRAM. Dato l'elevato utilizzo di memoria delle animazioni Lottie, si consiglia di spostare il più possibile la memoria dalla DRAM interna alla SPIRAM.

source: :cpp:expr:`lv_anim_init(&my_anim)` sets the Path to :cpp:func:`lv_anim_path_linear` by default.
it_it: :cpp:expr:`lv_anim_init(&my_anim)` imposta il Path su :cpp:func:`lv_anim_path_linear` per default.

source: :cpp:expr:`lv_anim_pause_for(animation, milliseconds)` is also available if you wish for the animation to resume automatically after.
it_it: :cpp:expr:`lv_anim_pause_for(animation, milliseconds)` è disponibile anche per riprendere automaticamente in seguito l'animazione.

source: :cpp:expr:`lv_anim_start(&anim_template)` makes its own copy of the Animation template, so if you do not need it later, its contents do not need to be preserved after this call.
it_it: :cpp:expr:`lv_anim_start(&anim_template)` crea una propria copia del template dell'Animazione, quindi, se non serve in seguito, non è necessario conservarne il contenuto dopo questa chiamata.

source: :cpp:expr:`lv_anim_timeline_add(timeline, start_time, &anim_template)` makes its own copy of the contents of the Animation template, so if you do not need it later, its contents do not need to be preserved after this call.
it_it: :cpp:expr:`lv_anim_timeline_add(timeline, start_time, &anim_template)` crea una propria copia del contenuto del template dell'Animazione, quindi, se non ce n'è bisogno in seguito, il suo contenuto non deve essere conservato dopo questa chiamata.

source: :cpp:expr:`lv_bar_set_orientation(bar, orientation)` to override orientation caused by ``width`` and ``height``.
it_it: :cpp:expr:`lv_bar_set_orientation(bar, orientation)` per sovrascrivere l'orientamento causato da ``width`` e ``height``.

source: :cpp:expr:`lv_buttonmatrix_get_button_text(btn_matrix, button_id)` returns a pointer to the text of the button specified by zero-based index ``button_id``.
it_it: :cpp:expr:`lv_buttonmatrix_get_button_text(btn_matrix, button_id)` restituisce un puntatore al testo del pulsante specificato dall'indice a base zero ``button_id``.

source: :cpp:expr:`lv_buttonmatrix_get_selected_button(btn_matrix)` returns the index of the button most recently released (the button with focus) or :cpp:enumerator:`LV_BUTTONMATRIX_BUTTON_NONE` if no such button was found.
it_it: :cpp:expr:`lv_buttonmatrix_get_selected_button(btn_matrix)` restituisce l'indice del pulsante rilasciato più di recente (il pulsante con il focus) oppure :cpp:enumerator:`LV_BUTTONMATRIX_BUTTON_NONE` se non è stato trovato alcun pulsante di questo tipo.

source: :cpp:expr:`lv_buttonmatrix_set_button_ctrl(btn_matrix, button_id, LV_BUTTONMATRIX_CTRL_...)` and
it_it: :cpp:expr:`lv_buttonmatrix_set_button_ctrl(btn_matrix, button_id, LV_BUTTONMATRIX_CTRL_...)` e

source: :cpp:expr:`lv_buttonmatrix_set_button_ctrl_all(btn_matrix, LV_BUTTONMATRIX_CTRL_...)` and
it_it: :cpp:expr:`lv_buttonmatrix_set_button_ctrl_all(btn_matrix, LV_BUTTONMATRIX_CTRL_...)` e
